#### Terraform Initialization ⚙️ `success`

#### Terraform Validation ✅ `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

data.cloudflare_zones.zone_search: Reading...
data.cloudflare_accounts.account_search: Reading...
data.cloudflare_zones.zone_search: Read complete after 1s [name=pascaliske.dev]
data.cloudflare_zone.zone: Reading...
data.cloudflare_accounts.account_search: Read complete after 1s [name=Pascal Iske]
data.cloudflare_account.account: Reading...
data.cloudflare_zone.zone: Read complete after 0s
cloudflare_dns_record.spf: Refreshing state... [id=f45826d2d351bb30c98bc916a6c1a8d0]
cloudflare_dns_record.mail_lockdown: Refreshing state... [id=a0d4e7bfade553ccfef588b010ba823f]
cloudflare_dns_record.bimi: Refreshing state... [id=343168ec6ec621d98d7f3c21812f9ffb]
cloudflare_dns_record.dkim: Refreshing state... [id=c318f9e1465c4f33e52cbb14713311e5]
cloudflare_dns_record.dmarc: Refreshing state... [id=a1a8eac1293bae6f6d1aa2462c85fd6a]
cloudflare_page_rule.redirect_www: Refreshing state... [id=6a82af278deaf335d089cbbad17f2489]
cloudflare_dns_record.have_i_been_pwned: Refreshing state... [id=fd40066a24b3b54b37c2e846f929e761]
cloudflare_dns_record.production_www_ipv6: Refreshing state... [id=097b10faaf70d2dd40099ae8f1ce0b6f]
cloudflare_dns_record.production_www_ipv4: Refreshing state... [id=f7d23497a2fe25a4152ca4d0b4773a34]
data.cloudflare_account.account: Read complete after 0s
cloudflare_dns_record.openpgpkey: Refreshing state... [id=9d39803fea1161900eadb3ec265d56f6]
cloudflare_dns_record.bluesky: Refreshing state... [id=8b2806a3a311a5b28fdae58c0806b976]
cloudflare_dns_record.google: Refreshing state... [id=6752099686cc4ba30a0c6ab61efc57d5]
cloudflare_dns_record.next_ipv6: Refreshing state... [id=9c3b3926aef1e73291ba9c363e79c108]
cloudflare_dns_record.next_ipv4: Refreshing state... [id=4c7264671b72dccd05af23471ba88f43]
cloudflare_dns_record.mail: Refreshing state... [id=0a7cf42fee140ef2c515f7e244b79b62]
cloudflare_dns_record.production_ipv4: Refreshing state... [id=f6da7cf81e26104ddcc6c4d5d445a8c9]
cloudflare_dns_record.production_ipv6: Refreshing state... [id=6e15ba5c162a9aaf0b0169b4742dd564]
cloudflare_list.redirect_legacy_pages: Refreshing state... [id=834ea16ce6424b70b066002e7f8a5269]
cloudflare_list_item.redirect_legacy_imprint: Refreshing state... [id=6578d80ee6e84ff587f4a28b78d65365]
cloudflare_list_item.redirect_legacy_about: Refreshing state... [id=aa5dc67dd1494f74b43e060c9e479075]
cloudflare_list_item.redirect_legacy_privacy: Refreshing state... [id=069a36a5a93d4470a58e692411995e70]
cloudflare_ruleset.redirect_legacy_pages: Refreshing state... [id=ebbbaa274a264aa8a843931e56568ea0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.bimi will be updated in-place
  ~ resource "cloudflare_dns_record" "bimi" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:12Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "343168ec6ec621d98d7f3c21812f9ffb"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2023-04-11T09:25:49Z" -> (known after apply)
      ~ name                = "default._bimi.pascaliske.dev" -> "default._bimi"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.bluesky will be updated in-place
  ~ resource "cloudflare_dns_record" "bluesky" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2024-10-25T03:06:43Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "8b2806a3a311a5b28fdae58c0806b976"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2024-10-25T03:06:43Z" -> (known after apply)
      ~ name                = "_atproto.pascaliske.dev" -> "_atproto"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2023-06-19T08:33:42Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "c318f9e1465c4f33e52cbb14713311e5"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2023-06-19T08:33:42Z" -> (known after apply)
      ~ name                = "uberspace._domainkey.pascaliske.dev" -> "uberspace._domainkey"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dmarc will be updated in-place
  ~ resource "cloudflare_dns_record" "dmarc" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:12Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "a1a8eac1293bae6f6d1aa2462c85fd6a"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:12Z" -> (known after apply)
      ~ name                = "_dmarc.pascaliske.dev" -> "_dmarc"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mail will be updated in-place
  ~ resource "cloudflare_dns_record" "mail" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:48:33Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "0a7cf42fee140ef2c515f7e244b79b62"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:48:54Z" -> (known after apply)
      ~ name                = "pascaliske.dev" -> "@"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mail_lockdown will be updated in-place
  ~ resource "cloudflare_dns_record" "mail_lockdown" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2023-07-16T13:25:23Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "a0d4e7bfade553ccfef588b010ba823f"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2023-07-16T13:25:23Z" -> (known after apply)
      ~ name                = "_mailchannels.pascaliske.dev" -> "_mailchannels"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.next_ipv4 will be updated in-place
  ~ resource "cloudflare_dns_record" "next_ipv4" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:13Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "4c7264671b72dccd05af23471ba88f43"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:13Z" -> (known after apply)
      ~ name                = "next.pascaliske.dev" -> "next"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.next_ipv6 will be updated in-place
  ~ resource "cloudflare_dns_record" "next_ipv6" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:16Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "9c3b3926aef1e73291ba9c363e79c108"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:16Z" -> (known after apply)
      ~ name                = "next.pascaliske.dev" -> "next"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.openpgpkey will be updated in-place
  ~ resource "cloudflare_dns_record" "openpgpkey" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:11Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "9d39803fea1161900eadb3ec265d56f6"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:11Z" -> (known after apply)
      ~ name                = "openpgpkey.pascaliske.dev" -> "openpgpkey"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.production_ipv4 will be updated in-place
  ~ resource "cloudflare_dns_record" "production_ipv4" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:12Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "f6da7cf81e26104ddcc6c4d5d445a8c9"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:12Z" -> (known after apply)
      ~ name                = "pascaliske.dev" -> "@"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.production_ipv6 will be updated in-place
  ~ resource "cloudflare_dns_record" "production_ipv6" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:16Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "6e15ba5c162a9aaf0b0169b4742dd564"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:16Z" -> (known after apply)
      ~ name                = "pascaliske.dev" -> "@"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.production_www_ipv4 will be updated in-place
  ~ resource "cloudflare_dns_record" "production_www_ipv4" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:16Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "f7d23497a2fe25a4152ca4d0b4773a34"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:16Z" -> (known after apply)
      ~ name                = "www.pascaliske.dev" -> "www"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.production_www_ipv6 will be updated in-place
  ~ resource "cloudflare_dns_record" "production_www_ipv6" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-30T11:41:12Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "097b10faaf70d2dd40099ae8f1ce0b6f"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-30T11:41:12Z" -> (known after apply)
      ~ name                = "www.pascaliske.dev" -> "www"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_page_rule.redirect_www will be updated in-place
  ~ resource "cloudflare_page_rule" "redirect_www" {
      ~ actions     = {
          + forwarding_url = {
              + status_code = 301
              + url         = "https://pascaliske.dev/$1"
            }
        }
      ~ created_on  = "2025-02-23T20:00:23Z" -> (known after apply)
        id          = "6a82af278deaf335d089cbbad17f2489"
      ~ modified_on = "2025-02-23T20:04:00Z" -> (known after apply)
      + target      = "www.pascaliske.dev*"
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 14 to change, 0 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Workflow: `Terraform`*